; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	spectrograph1 - mode
	image2 - mode
	infrared0 - mode
	Star0 - direction
	Star6 - direction
	Star4 - direction
	GroundStation2 - direction
	Star7 - direction
	Star1 - direction
	Star5 - direction
	GroundStation3 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument1 spectrograph1)
	(supports instrument1 infrared0)
	(supports instrument1 image2)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star7)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star7)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument3 spectrograph1)
	(supports instrument3 image2)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 Star5)
	(supports instrument4 image2)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star5)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
)
(:goal (and
	(have_image Star8 image2)
	(have_image Star9 infrared0)
	(have_image Star10 infrared0)
	(have_image Star11 spectrograph1)
	(have_image Planet12 spectrograph1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (calibrate satellite0 instrument0 star5)
   added: (calibrated instrument0)
   goals met: 0 of 5
3. (turn_to satellite0 star11 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star11)
   goals met: 0 of 5
4. (take_image satellite0 star11 instrument0 spectrograph1)
   added: (have_image star11 spectrograph1)
   goals met: 1 of 5
5. (turn_to satellite0 star10 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star10)
   goals met: 1 of 5
6. (take_image satellite0 star10 instrument0 infrared0)
   added: (have_image star10 infrared0)
   goals met: 2 of 5
7. (turn_to satellite0 planet12 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet12)
   goals met: 2 of 5
8. (take_image satellite0 planet12 instrument0 spectrograph1)
   added: (have_image planet12 spectrograph1)
   goals met: 3 of 5
9. (turn_to satellite0 star8 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star8)
   goals met: 3 of 5
10. (take_image satellite0 star8 instrument0 image2)
   added: (have_image star8 image2)
   goals met: 4 of 5
11. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   goals met: 4 of 5
12. (take_image satellite0 star9 instrument0 infrared0)
   added: (have_image star9 infrared0)
   goals met: 5 of 5
